jrr30/STM32F44_Digital_Clock/Core/appl/LCD/LCD16.c
/*
 * LCD16.c
 *
 *  Created on: Sep 8, 2023
 *      Author: Jesus
 */
 /**
  * Datasheet https://www.vishay.com/docs/37484/lcd016n002bcfhet.pdf
  * */

#include "../appl/LCD/LCD16.h"
#include "../appl/APPINTF/APPINTF.h"

#include "stm32f4xx_hal.h"
#include <main.h>

typedef enum Row_Character_t
{
  Character_Row_0,
  Character_Row_1,
  Character_Row_2,
  Character_Row_3,
  Character_Row_4,
  Character_Row_5,
  Character_Row_6,
  Character_Row_7,

  Max_Character_Row
}Row_Character_T;

static void Write_Command(uint8_t com);
static void Enable_Pulse(void);

static uint8_t Bell_Custome_Character [Max_Character_Row] =
    {
	0b00100,
	0b01110,
	0b01110,
	0b01110,
	0b11111,
	0b00000,
	0b00100,
	0b00000
    };

static void Enable_Pulse(void)
{
	HAL_GPIO_WritePin(PIN_CONTROL_PORT, ENABLE, GPIO_PIN_SET);
	delay_us(1);
	HAL_GPIO_WritePin(PIN_CONTROL_PORT, ENABLE, GPIO_PIN_RESET);
	delay_us(1);
}

/**
  * @brief  Write Data at low level as GPIO.
  *
  * @note   This function uses GPIO_HAL library to write 1 or 0 to the specific GPIO pin.
  *
  * @param  Command specifies the raw data in 1 byte.
  * @param  Rs specifies if the value to be wroten is either a command or data.
  *          This parameter can be one of the rs enum values:
  *            @arg COMMAND: to write a command in the LCD
  *            @arg DATA: to write data to the LCD.
  * @retval None
  */
static void Write_Data_Command_GPIO(uint8_t command, uint8_t rs)
{
	 HAL_GPIO_WritePin(PIN_CONTROL_PORT, RS|RW|ENABLE, GPIO_PIN_RESET);

#if 0
	uint8_t iter = 0x00u;
	uint8_t aux_variable = 0x00u;
	uint16_t bits_value = 0x00u;
	uint16_t GPIOC_PINs [MODE_DATA_4] = {GPIO_PIN_5,GPIO_PIN_6,GPIO_PIN_8,GPIO_PIN_9};
	uint8_t Offset_shiftting [MODE_DATA_4] = {0x05u,0x06u,0x08u,0x09u};
#endif

	if(rs == COMMAND)
	{
		HAL_GPIO_WritePin(PIN_CONTROL_PORT, RS, GPIO_PIN_RESET);
	}
	else
	{
		HAL_GPIO_WritePin(PIN_CONTROL_PORT, RS, GPIO_PIN_SET);
	}

#if 0
	for(iter = 0; iter <= MODE_DATA_4; iter++)
	{
		aux_variable = (0x01u & (command >> iter));
		bits_value  |= (GPIOC_PINs[iter] & (aux_variable<<Offset_shiftting[iter]));
	}

	GPIOC->BSRR = bits_value;
#endif

	HAL_GPIO_WritePin(DATA_D4_GPIO_Port,DATA_D4,((command>>0)&TRUE_VALUE));
	HAL_GPIO_WritePin(DATA_D5_GPIO_Port,DATA_D5,((command>>1)&TRUE_VALUE));
	HAL_GPIO_WritePin(DATA_D6_GPIO_Port,DATA_D6,((command>>2)&TRUE_VALUE));
	HAL_GPIO_WritePin(DATA_D7_GPIO_Port,DATA_D7,((command>>3)&TRUE_VALUE));

	Enable_Pulse();
	delay_us(1);
	HAL_GPIO_WritePin(DATA_D4_GPIO_Port,DATA_D4,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DATA_D5_GPIO_Port,DATA_D5,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DATA_D6_GPIO_Port,DATA_D6,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DATA_D7_GPIO_Port,DATA_D7,GPIO_PIN_RESET);
}

/**
  * @brief  Write command
  *
  * @note   This function is specific to write a single command to control the LCD.
  *
  * @param  Command specifies the command to be executed.
  *           @arg command: this instruction can be taken from the macros "Set of commands to operate the LCD"
  * @retval None
  */
static void Write_Command(uint8_t com)
{
	uint8_t command_lcd = COMMAND;
	Write_Data_Command_GPIO(((MASK_HIGH&com)>>4), command_lcd);
	Write_Data_Command_GPIO( (MASK_LOW&com), command_lcd);
}

/**
  * @brief  Write character
  *
  * @note   This function is specific to write a single character in the display.
  * 		Check Character Generator ROM Pattern table to see how Characters are display.
  * 		E.g to display 0 (Ascii), we must tell to this function to write 0x30
  * 		E.g if we want to display GCRAMM cero, we must sent 0x00 or 0x04
  *
  * 		If we send the command SET CGRAM Address first, we will write in the internal CGRAM memory.
  * 		Then we can create the custome characters.
  *
  * @param  Command specifies the raw as single character
  * @retval None
  */
void Write_Data(uint8_t data)
{
	uint8_t data_lcd = DATA;
	Write_Data_Command_GPIO(((MASK_HIGH&data)>>4), data_lcd);
	Write_Data_Command_GPIO( MASK_LOW&data, data_lcd);
}

/**
  * @brief  Specific function to perform the initial configuration.
  *
  * @note   This function do the configuration as 4 bit mode.
  *           if 8 bit mode is needed, this must be done.
  * @retval None
  */
void LCD_Config(void)
{
	Row_Character_T iter = Character_Row_0;

	delay_us(20000);
	Write_Data_Command_GPIO(0x03u, COMMAND);
	delay_us(7000);
	Write_Data_Command_GPIO(0x03u, COMMAND);
	delay_us(100);
	Write_Data_Command_GPIO(0x03u, COMMAND);
	delay_us(7000);

	Write_Data_Command_GPIO(0x02u,COMMAND);
	delay_us(40);

	Write_Command(M4BIT|M2LINE|M5_8_Font);

	Write_Command(ONDisp|OFFCursor|OFFBlink);

	Write_Command(CLEAR_SCREEN);
	delay_us(2000);

	Write_Command(IncAdd);
	Write_Command(CURSOR_RETURN);
	delay_us(2000);



	Write_Command(SET_CGRAM_2);

	for(iter = Character_Row_0; iter < Max_Character_Row;iter++)
	  {
	    Write_Data(Bell_Custome_Character[iter]);
	  }

}

/**
  * @brief  Displays a string in the LCD.
  *
  * @note   This function shows in the LCD a string.
  * @param  row string can be in ASCII format but always in a array.
  * @retval None
  */
void print_string(uint8_t * lcd_str)
{
  if(NULL != lcd_str)
    {
      uint8_t iter = 0;

      while (lcd_str[iter] != '\0')
        {
          Write_Data ((uint8_t) lcd_str[iter]);
          iter++;
        }
    }
}

/**
  * @brief  Set cursor at the location given.
  *
  * @note   This function Set the cursor in the display at any column and row.
  *           Column and row must be provided.
  * @param  row sets wich row information will be display.
  *          This parameter can be one of the Column_lcd enum values:
  *            @arg Row_1: Display cursor in the first row.
  *            @arg Row_2: Display cursor in the second row.
  * @param  column placed cursor in the specific column.
  *          This parameter can be one of the Column_lcd enum values:
  *            @arg Column_lcd: Columns staring in 1 up to 16.
  * @retval None
  */
void Set_Cursor(Row_lcd row, uint8_t column)
{
	if (Row_1 == row)
	{
		Write_Command((ROW_ONE_OFFSET<<4)|column);
	}
	else
	{
		Write_Command((ROW_TWO_OFFSET<<4)|column);
	}
}

/**
  * @brief  Display_ONOFF_Control.
  *
  * @note   This function Set the cursor in the display at any column and row.
  *           Column and row must be provided.
  * @param  row sets wich row information will be display.
  *          This parameter can be one of the Column_lcd enum values:
  *            @arg Row_1: Display cursor in the first row.
  *            @arg Row_2: Display cursor in the second row.
  * @param  column placed cursor in the specific column.
  *          This parameter can be one of the Column_lcd enum values:
  *            @arg Column_lcd: Columns staring in 1 up to 16.
  * @retval None
  */
void Display_ONOFF_Control(LCD16_Display_bit_enable_T set_display_enable_e, LCD16_cursor_bit_enable_T cursor_enable_e, LCD16_blink_bit_enable_T blink_enable_e)
{

  Write_Command( (FIX_DB3) |
		 (set_display_enable_e << DISPLAY_POSITION) |
		 (cursor_enable_e << CURSOR_POSITION) |
		 (blink_enable_e << BLINK_POSITION));
}

/**
  * @brief  Clear Screen
  *
  * @note   This function will clear information displayed in the screen, but this will not set cursor at home position.
  * @retval None
  */
void Clear(void)
{
	Write_Command(CLEAR_SCREEN);
	delay_us(2000);

}

/**
  * @brief  Set cursor in Home position.
  *
  * @note   This function will set the cursor to the home address in the LCD Screen which is Column 1 and Row 1
  * @retval None
  */
void Home(void)
{
	Write_Command(CURSOR_RETURN);
	delay_us(2000);
}

void LCDEF_Print_Str(void)
{
  LCD_Out_Buffer_T local_buffef = {0u};
//  uint8_t alarm_setting_ready = 0u;
//  uint8_t row_cursor_alarm = 0u;
//  uint8_t colum_cursor_alarm = 0u;

  APPIFEF_Get_OutBuffer(&local_buffef);

  Set_Cursor(Row_1, local_buffef.Up_Row_Buffer.colum_position);
  print_string(local_buffef.Up_Row_Buffer.appif_out_buffer_u8);

  Set_Cursor(Row_2, local_buffef.Down_Row_Buffer.colum_position);
  print_string(local_buffef.Down_Row_Buffer.appif_out_buffer_u8);

//  alarm_setting_ready = APPIFEF_Get_Alarm_Status_Cfg(&row_cursor_alarm, &colum_cursor_alarm);

//  if(1 == alarm_setting_ready)
//    {
//      Set_Cursor(row_cursor_alarm, colum_cursor_alarm);
//      Display_ONOFF_Control(LCD16_display_enable, LCD16_cursor_disable, LCD16_blink_enable);
//    }
//  else
//  {
//	  Display_ONOFF_Control(LCD16_display_enable, LCD16_cursor_disable, LCD16_blink_disable);
//  }

}


void LCDEF_Print_Custome_Char(Char_Custome_T char_number, Row_lcd row, Column_lcd column)
{

	Set_Cursor(row,column);

	if(Char_Bell_Custome == char_number )
	  {
	    Write_Data(DISPLAY_CGRAM_2);
	  }
}
